{
 "_id": "5db749b98e21460012ec312c",
 "version": "5daf2e65f4109c0040fd51e5",
 "project": "5daf2e65f4109c0040fd51e1",
 "user": "5b8400d7185d5e00036dcc3b",
 "parentDoc": "5db748eb63fc5f002c5fee32",
 "category": "5db0a86967f978006336b1b5",
 "__v": 1,
 "updates": [],
 "updatedAt": "2019-11-13T21:24:28.666Z",
 "createdAt": "2019-10-28T20:04:09.555Z",
 "next": {
  "pages": [
   {
    "category": "Core Guides",
    "slug": "core-guide-operating-modes",
    "name": "Operating Modes",
    "icon": "file-text-o",
    "type": "doc"
   }
  ],
  "description": ""
 },
 "link_external": false,
 "link_url": "",
 "sync_unique": "",
 "hidden": false,
 "api": {
  "results": {
   "codes": [
    {
     "name": "",
     "code": "{}",
     "language": "json",
     "status": 200
    },
    {
     "name": "",
     "code": "{}",
     "language": "json",
     "status": 400
    }
   ]
  },
  "auth": "required",
  "params": [],
  "url": "",
  "method": "get"
 },
 "isReference": false,
 "order": 1,
 "body": "Dash wallets at their core are a collection of <<glossary:private keys>>. These collections are stored digitally in a file, or can even be physically stored on pieces of paper.\n\n# Private Key Formats\n\nPrivate keys are what are used to unlock <<glossary:duffs>> from a particular <<glossary:address>>. In Dash, a private key in standard format is simply a 256-bit number, between the values:\n\n`0x01` and `0xFFFF FFFF FFFF FFFF FFFF FFFF FFFF FFFE BAAE DCE6 AF48 A03B BFD2 5E8C D036 4140`, representing nearly the entire range of 2<sup>256</sup>-1 values. The range is governed by the secp256k1 ECDSA encryption standard used by Dash.\n\n## Wallet Import Format (WIF)\n\nIn order to make copying of private keys less prone to error, <<glossary:Wallet Import Format>> may be utilized. WIF uses <<glossary:base58check>> encoding on a private key, greatly decreasing the chance of copying error, much like standard Dash <<glossary:addresses>>.\n\n1. Take a private key.\n\n2. Add a `0xCC` byte in front of it for <<glossary:mainnet>> addresses or `0xEF` for <<glossary:testnet>> addresses.\n\n3. Append a `0x01` byte after it if it should be used with compressed public keys (described in a later subsection). Nothing is appended if it is used with uncompressed public keys.\n\n4. Perform a SHA-256 hash on the <<glossary:extended key>>.\n\n5. Perform a SHA-256 hash on result of SHA-256 hash.\n\n6. Take the first four bytes of the second SHA-256 hash; this is the checksum.\n\n7. Add the four checksum bytes from point 5 at the end of the extended key from point 2.\n\n8. Convert the result from a byte string into a Base58 string using Base58Check encoding.\n\nThe process is easily reversible, using the Base58 decoding function, and removing the padding.\n\n## Mini Private Key Format\n\nMini private key format is a method for encoding a private key in under 30 characters, enabling keys to be embedded in a small physical space and more damage-resistant QR codes.\n\n1. The first character of mini keys is '`S`'.\n\n2. In order to determine if a mini private key is well-formatted, a question mark is added to the private key.\n\n3. The SHA256 hash is calculated. If the first byte produced is a `00`, it is well-formatted. This key restriction acts as a typo-checking mechanism. A user brute forces the process using random numbers until a well-formatted mini private key is produced.\n\n4. In order to derive the full private key, the user simply takes a single SHA256 hash of the original mini private key. This process is one-way: it is intractable to compute the mini private key format from the derived key.\n\nMany implementations disallow the character '1' in the mini private key due to its visual similarity to 'l'.\n\n**Resource:** A common tool to create and redeem these keys is the [Casascius Bitcoin Address Utility](https://github.com/casascius/Bitcoin-Address-Utility). Note: this tool is no longer actively developed.\n\n# Public Key Formats\n\nDash ECDSA public keys represent a point on a particular Elliptic Curve (EC) defined in secp256k1. In their traditional uncompressed form, public keys contain an identification byte, a 32-byte X coordinate, and a 32-byte Y coordinate. The extremely simplified illustration below shows such a point on the elliptic curve used by Dash, y<sup>2</sup>&nbsp;=&nbsp;x<sup>3</sup>&nbsp;+&nbsp;7, over a field of contiguous numbers.\n\n![Point On ECDSA Curve](https://dash-docs.github.io/img/dev/en-ecdsa-compressed-public-key.svg)\n\n(Secp256k1 actually modulos coordinates by a large prime, which produces a field of non-contiguous integers and a significantly less clear plot, although the principles are the same.)\n\nAn almost 50% reduction in <<glossary:public key>> size can be realized without changing any fundamentals by dropping the Y coordinate. This is possible because only two points along the curve share any particular X coordinate, so the 32-byte Y coordinate can be replaced with a single bit indicating whether the point is on what appears in the illustration as the \"top\" side or the \"bottom\" side.\n\nNo data is lost by creating a <<glossary:compressed public key>>---only a small amount of CPU is necessary to reconstruct the Y coordinate and access the uncompressed public key. Both uncompressed and compressed public keys are described in official secp256k1 documentation and supported by default in the widely-used OpenSSL library.\n\nBecause they're easy to use, and because they reduce almost by half the <<glossary:block chain>> space used to store public keys for every spent <<glossary:output>>, compressed public keys are the default in Dash Core and are the recommended default for all Dash software.\n\nHowever, Bitcoin Core prior to 0.6 used uncompressed keys.  This creates a few complications, as the hashed form of an uncompressed key is different than the hashed form of a compressed key, so the same key works with two different <<glossary:P2PKH>> addresses.   This also means that the key must be submitted in the correct format in the <<glossary:signature script>> so it matches the hash in the previous output's pubkey script.\n\nFor this reason, Bitcoin Core (and Dash Core) uses several different identifier bytes to help programs identify how keys should be used:\n\n* Private keys meant to be used with compressed public keys have 0x01 appended to them before being Base-58 encoded. (See the private key encoding section above.)\n\n* Uncompressed public keys start with 0x04; compressed public keys begin with 0x03 or 0x02 depending on whether they're greater or less than the midpoint of the curve.  These prefix bytes are all used in official secp256k1 documentation.\n\n# Hierarchical Deterministic Key Creation\n\nThe hierarchical deterministic key creation and transfer protocol (<<glossary:HD protocol>>) greatly simplifies wallet backups, eliminates the need for repeated communication between multiple programs using the same wallet, permits creation of child accounts which can operate independently, gives each parent account the ability to monitor or control its children even if the child account is compromised, and divides each account into full-access and restricted-access parts so untrusted users or programs can be allowed to receive or monitor payments without being able to spend them.\n\nThe HD protocol takes advantage of the ECDSA public key creation function, `<<glossary:point>>()`, which takes a large integer (the private key) and turns it into a graph point (the public key):\n\n    point(private_key) == public_key\n\nBecause of the way `point()` works, it's possible to create a <<glossary:child public key>> by combining an existing <<glossary:parent public key>> with another public key created from any integer (*i*) value. This child public key is the same public key which would be created by the `point()` function if you added the *i* value to the original (parent) private key and then found the remainder of that sum divided by a global constant used by all Dash software (*p*):\n\n    point( (parent_private_key + i) % p ) == parent_public_key + point(i)\n\nThis means that two or more independent programs which agree on a sequence of integers can create a series of unique <<glossary:child key>> pairs from a single <<glossary:parent key>> pair without any further communication. Moreover, the program which distributes new public keys for receiving payment can do so without any access to the private keys, allowing the public key distribution program to run on a possibly-insecure platform such as a public web server.\n\nChild public keys can also create their own child public keys (grandchild public keys) by repeating the child key derivation operations:\n\n    point( (child_private_key + i) % p ) == child_public_key + point(i)\n\nWhether creating child public keys or further-descended public keys, a predictable sequence of integer values would be no better than using a single public key for all transactions, as anyone who knew one child public key could find all of the other child public keys created from the same parent public key. Instead, a random seed can be used to deterministically generate the sequence of integer values so that the relationship between the child public keys is invisible to anyone without that seed.\n\nThe HD protocol uses a single <<glossary:root seed>> to create a hierarchy of child, grandchild, and other descended keys with unlinkable deterministically-generated integer values. Each child key also gets a deterministically-generated seed from its parent, called a <<glossary:chain code>>, so the compromising of one chain code doesn't necessarily compromise the integer sequence for the whole hierarchy, allowing the <<glossary:master chain code>> to continue being useful even if, for example, a web-based public key distribution program gets hacked.\n\n![Overview Of Hierarchical Deterministic Key Derivation](https://dash-docs.github.io/img/dev/en-hd-overview.svg)\n\nAs illustrated above, HD key derivation takes four inputs:\n\n* The *<<glossary:parent private key>>* and *<<glossary:parent public key>>* are regular uncompressed 256-bit ECDSA keys.\n\n* The <<glossary:parent chain code>> is 256 bits of seemingly-random data.\n\n* The <<glossary:index>> number is a 32-bit integer specified by the program.\n\nIn the normal form shown in the above illustration, the <<glossary:parent chain code>>, the parent public key, and the index number are fed into a one-way cryptographic hash ([HMAC-SHA512](https://en.wikipedia.org/wiki/HMAC)) to produce 512 bits of deterministically-generated-but-seemingly-random data. The seemingly-random 256 bits on the right-hand side of the hash output are used as a new child chain code. The seemingly-random 256 bits on the left-hand side of the hash output are used as the integer value to be combined with either the parent private key or parent public key to, respectively, create either a child private key or child public key:\n\n```\nchild_private_key == (parent_private_key + lefthand_hash_output) % G \nchild_public_key == point( (parent_private_key + lefthand_hash_output) % G ) \nchild_public_key == point(child_private_key) == parent_public_key + point(lefthand_hash_output)\n```\n\nSpecifying different index numbers will create different unlinkable child keys from the same parent keys.  Repeating the procedure for the child keys using the child chain code will create unlinkable grandchild keys.\n\nBecause creating child keys requires both a key and a chain code, the key and chain code together are called the <<glossary:extended key>>. An <<glossary:extended private key>> and its corresponding <<glossary:extended public key>> have the same chain code. The (top-level parent) <<glossary:master private key>> and master chain code are derived from random data, as illustrated below.\n\n![Creating A Root Extended Key Pair](https://dash-docs.github.io/img/dev/en-hd-root-keys.svg)\n\nA <<glossary:root seed>> is created from either 128 bits, 256 bits, or 512 bits of random data. This root seed of as little as 128 bits is the the only data the user needs to backup in order to derive every key created by a particular wallet program using particular settings.\n[block:callout]\n{\n  \"type\": \"warning\",\n  \"body\": \"**Warning:** HD wallet programs are not always fully compatible, so users must only use the same HD wallet program with the same HD-related settings for a particular root seed.\",\n  \"title\": \"HD Wallet Compatibility\"\n}\n[/block]\nThe root seed is hashed to create 512 bits of seemingly-random data, from which the master private key and master chain code are created (together, the master extended private key). The master public key is derived from the master private key using `point()`, which, together with the master chain code, is the master extended public key. The master extended keys are functionally equivalent to other extended keys; it is only their location at the top of the hierarchy which makes them special.\n\n## Hardened Keys\n\nHardened extended keys fix a potential problem with normal extended keys. If an attacker gets a normal parent chain code and parent public key, he can brute-force all chain codes deriving from it. If the attacker also obtains a child, grandchild, or further-descended private key, he can use the chain code to generate all of the extended private keys descending from that private key, as shown in the grandchild and great-grandchild generations of the illustration below.\n\n![Cross-Generational Key Compromise](https://dash-docs.github.io/img/dev/en-hd-cross-generational-key-compromise.svg)\n\nPerhaps worse, the attacker can reverse the normal <<glossary:child private key>> derivation formula and subtract a <<glossary:parent chain code>> from a child private key to recover the <<glossary:parent private key>>, as shown in the child and parent generations of the illustration above.  This means an attacker who acquires an <<glossary:extended public key>> and any private key descended from it can recover that public key's private key and all keys descended from it.\n\nFor this reason, the <<glossary:chain code>> part of an extended public key should be better secured than standard public keys and users should be advised against exporting even non-extended private keys to possibly-untrustworthy environments.\n\nThis can be fixed, with some tradeoffs, by replacing the the normal key derivation formula with a hardened key derivation formula.\n\nThe normal key derivation formula, described in the section above, combines together the index number, the parent chain code, and the parent public key to create the child chain code and the integer value which is combined with the parent private key to create the child private key.\n\n![Creating Child Public Keys From An Extended Private Key](https://dash-docs.github.io/img/dev/en-hd-private-parent-to-private-child.svg)\n\nThe hardened formula, illustrated above, combines together the index number, the parent chain code, and the parent private key to create the data used to generate the child chain code and child private key. This formula makes it impossible to create child public keys without knowing the parent private key. In other words, parent extended public keys can't create hardened child public keys.\n\nBecause of that, a <<glossary:hardened extended private key>> is much less useful than a normal extended private key---however, hardened extended private keys create a firewall through which multi-level key derivation compromises cannot happen. Because hardened child extended public keys cannot generate grandchild chain codes on their own, the compromise of a parent extended public key cannot be combined with the compromise of a grandchild private key to create great-grandchild extended private keys.\n\nThe HD protocol uses different index numbers to indicate whether a normal or hardened key should be generated. Index numbers from `0x00` to `0x7fffffff` (0 to 2<sup>31</sup>-1) will generate a normal key; index numbers from `0x80000000` to `0xffffffff` will generate a hardened key. To make descriptions easy, many developers use the [prime symbol](https://en.wikipedia.org/wiki/Prime_%28symbol%29) to indicate hardened keys, so the first normal key (0x00) is 0 and the first hardened key (0x80000000) is 0´.\n[block:callout]\n{\n  \"type\": \"info\",\n  \"body\": \"Dash developers typically use the ASCII apostrophe rather than the unicode prime symbol, a convention we will henceforth follow.\"\n}\n[/block]\nThis compact description is further combined with slashes prefixed by *m* or *M* to indicate hierarchy and key type, with *m* being a private key and *M* being a public key. For example, m/0'/0/122' refers to the 123rd hardened private child (by index number) of the first normal child (by index) of the first hardened child (by index) of the master private key. The following hierarchy illustrates prime notation and hardened key firewalls.\n\n![Example HD Wallet Tree Using Prime Notation](https://dash-docs.github.io/img/dev/en-hd-tree.svg)\n\nWallets following the <<glossary:BIP32>> <<glossary:HD protocol>> only create hardened children of the master private key (*m*) to prevent a compromised child key from compromising the master key. As there are no normal children for the master keys, the master public key is not used in HD wallets. All other keys can have normal children, so the corresponding extended public keys may be used instead.\n\nThe HD protocol also describes a serialization format for extended public keys and extended private keys.  For details, please see the [wallet section in the developer reference](core-ref-wallets) or [BIP32](https://github.com/bitcoin/bips/blob/master/bip-0032.mediawiki) for the full HD protocol specification.\n\n## Storing Root Seeds\n\nRoot seeds in the HD protocol are 128, 256, or 512 bits of random data which must be backed up precisely. To make it more convenient to use non-digital backup methods, such as memorization or hand-copying, [BIP39](https://github.com/bitcoin/bips/blob/master/bip-0039.mediawiki) defines a method for creating a 512-bit root seed from a pseudo-sentence (mnemonic) of common natural-language words which was itself created from 128 to 256 bits of entropy and optionally protected by a password.\n\nThe number of words generated correlates to the amount of entropy used:\n\n| Entropy Bits |  Words |\n| --- | --- |\n|  128         |    12  |\n|  160         |    15  |\n|  192         |    18  |\n|  224         |    21  |\n|  256         |    24  |\n\nThe passphrase can be of any length.  It is simply appended to the mnemonic pseudo-sentence, and then both the mnemonic and password are hashed 2,048 times using HMAC-SHA512, resulting in a seemingly-random 512-bit seed.  Because any input to the hash function creates a seemingly-random 512-bit seed, there is no fundamental way to prove the user entered the correct password, possibly allowing the user to protect a seed even when under duress.\n\nFor implementation details, please see [BIP39](https://github.com/bitcoin/bips/blob/master/bip-0039.mediawiki).\n\n# Loose-Key Wallets\n\nLoose-Key wallets, also called \"Just a Bunch Of Keys (JBOK)\", are a form of wallet that originated from the Bitcoin Core client wallet. The Dash Core client wallet creates 1000 private key/public key pairs automatically via a Pseudo-Random-Number Generator (PRNG) for later use.\n\nThese unused private keys are stored in a virtual \"key pool\", with new keys being generated whenever a previously-generated key was used, ensuring the pool maintained 1000 unused keys. (If the wallet is encrypted, new keys are only generated while the wallet is unlocked.)\n\nThis creates considerable difficulty in backing up one’s keys, considering backups have to be run manually to save the newly-generated private keys. If a new key pair set is generated, used, and then lost prior to a backup, the stored duffs are likely lost forever. Many older-style mobile wallets followed a similar format, but only generated a new private key upon user demand.\n\nThis wallet type is being actively phased out and discouraged from being used due to the backup hassle.",
 "excerpt": "",
 "slug": "core-guide-wallets-wallet-files",
 "type": "basic",
 "metadata": {
  "description": "",
  "title": "",
  "image": []
 },
 "title": "Wallet Files",
 "id": "5db749b98e21460012ec312c",
 "isApi": false,
 "body_html": "<div class=\"magic-block-textarea\"><p>Dash wallets at their core are a collection of &lt;&lt;glossary:private keys&gt;&gt;. These collections are stored digitally in a file, or can even be physically stored on pieces of paper.</p>\n<h1 class=\"header-scroll\"><div class=\"anchor waypoint\" id=\"section-private-key-formats\"></div>Private Key Formats<a class=\"fa fa-anchor\" href=\"#section-private-key-formats\"></a></h1>\n<p>Private keys are what are used to unlock &lt;&lt;glossary:duffs&gt;&gt; from a particular &lt;&lt;glossary:address&gt;&gt;. In Dash, a private key in standard format is simply a 256-bit number, between the values:</p>\n<p><code>0x01</code> and <code>0xFFFF FFFF FFFF FFFF FFFF FFFF FFFF FFFE BAAE DCE6 AF48 A03B BFD2 5E8C D036 4140</code>, representing nearly the entire range of 2<sup>256</sup>-1 values. The range is governed by the secp256k1 ECDSA encryption standard used by Dash.</p>\n<h2 class=\"header-scroll\"><div class=\"anchor waypoint\" id=\"section-wallet-import-format-wif-\"></div>Wallet Import Format (WIF)<a class=\"fa fa-anchor\" href=\"#section-wallet-import-format-wif-\"></a></h2>\n<p>In order to make copying of private keys less prone to error, &lt;&lt;glossary:Wallet Import Format&gt;&gt; may be utilized. WIF uses &lt;&lt;glossary:base58check&gt;&gt; encoding on a private key, greatly decreasing the chance of copying error, much like standard Dash &lt;&lt;glossary:addresses&gt;&gt;.</p>\n<ol>\n<li  value=\"1\"><p>Take a private key.</p>\n</li><li  value=\"2\"><p>Add a <code>0xCC</code> byte in front of it for &lt;&lt;glossary:mainnet&gt;&gt; addresses or <code>0xEF</code> for &lt;&lt;glossary:testnet&gt;&gt; addresses.</p>\n</li><li  value=\"3\"><p>Append a <code>0x01</code> byte after it if it should be used with compressed public keys (described in a later subsection). Nothing is appended if it is used with uncompressed public keys.</p>\n</li><li  value=\"4\"><p>Perform a SHA-256 hash on the &lt;&lt;glossary:extended key&gt;&gt;.</p>\n</li><li  value=\"5\"><p>Perform a SHA-256 hash on result of SHA-256 hash.</p>\n</li><li  value=\"6\"><p>Take the first four bytes of the second SHA-256 hash; this is the checksum.</p>\n</li><li  value=\"7\"><p>Add the four checksum bytes from point 5 at the end of the extended key from point 2.</p>\n</li><li  value=\"8\"><p>Convert the result from a byte string into a Base58 string using Base58Check encoding.</p>\n</li></ol>\n<p>The process is easily reversible, using the Base58 decoding function, and removing the padding.</p>\n<h2 class=\"header-scroll\"><div class=\"anchor waypoint\" id=\"section-mini-private-key-format\"></div>Mini Private Key Format<a class=\"fa fa-anchor\" href=\"#section-mini-private-key-format\"></a></h2>\n<p>Mini private key format is a method for encoding a private key in under 30 characters, enabling keys to be embedded in a small physical space and more damage-resistant QR codes.</p>\n<ol>\n<li  value=\"1\"><p>The first character of mini keys is &#39;<code>S</code>&#39;.</p>\n</li><li  value=\"2\"><p>In order to determine if a mini private key is well-formatted, a question mark is added to the private key.</p>\n</li><li  value=\"3\"><p>The SHA256 hash is calculated. If the first byte produced is a <code>00</code>, it is well-formatted. This key restriction acts as a typo-checking mechanism. A user brute forces the process using random numbers until a well-formatted mini private key is produced.</p>\n</li><li  value=\"4\"><p>In order to derive the full private key, the user simply takes a single SHA256 hash of the original mini private key. This process is one-way: it is intractable to compute the mini private key format from the derived key.</p>\n</li></ol>\n<p>Many implementations disallow the character &#39;1&#39; in the mini private key due to its visual similarity to &#39;l&#39;.</p>\n<p><strong>Resource:</strong> A common tool to create and redeem these keys is the <a href=\"https://github.com/casascius/Bitcoin-Address-Utility\">Casascius Bitcoin Address Utility</a>. Note: this tool is no longer actively developed.</p>\n<h1 class=\"header-scroll\"><div class=\"anchor waypoint\" id=\"section-public-key-formats\"></div>Public Key Formats<a class=\"fa fa-anchor\" href=\"#section-public-key-formats\"></a></h1>\n<p>Dash ECDSA public keys represent a point on a particular Elliptic Curve (EC) defined in secp256k1. In their traditional uncompressed form, public keys contain an identification byte, a 32-byte X coordinate, and a 32-byte Y coordinate. The extremely simplified illustration below shows such a point on the elliptic curve used by Dash, y<sup>2</sup>&nbsp;=&nbsp;x<sup>3</sup>&nbsp;+&nbsp;7, over a field of contiguous numbers.</p>\n<p><img src=\"https://dash-docs.github.io/img/dev/en-ecdsa-compressed-public-key.svg\" alt=\"Point On ECDSA Curve\"></p>\n<p>(Secp256k1 actually modulos coordinates by a large prime, which produces a field of non-contiguous integers and a significantly less clear plot, although the principles are the same.)</p>\n<p>An almost 50% reduction in &lt;&lt;glossary:public key&gt;&gt; size can be realized without changing any fundamentals by dropping the Y coordinate. This is possible because only two points along the curve share any particular X coordinate, so the 32-byte Y coordinate can be replaced with a single bit indicating whether the point is on what appears in the illustration as the &quot;top&quot; side or the &quot;bottom&quot; side.</p>\n<p>No data is lost by creating a &lt;&lt;glossary:compressed public key&gt;&gt;---only a small amount of CPU is necessary to reconstruct the Y coordinate and access the uncompressed public key. Both uncompressed and compressed public keys are described in official secp256k1 documentation and supported by default in the widely-used OpenSSL library.</p>\n<p>Because they&#39;re easy to use, and because they reduce almost by half the &lt;&lt;glossary:block chain&gt;&gt; space used to store public keys for every spent &lt;&lt;glossary:output&gt;&gt;, compressed public keys are the default in Dash Core and are the recommended default for all Dash software.</p>\n<p>However, Bitcoin Core prior to 0.6 used uncompressed keys.  This creates a few complications, as the hashed form of an uncompressed key is different than the hashed form of a compressed key, so the same key works with two different &lt;&lt;glossary:P2PKH&gt;&gt; addresses.   This also means that the key must be submitted in the correct format in the &lt;&lt;glossary:signature script&gt;&gt; so it matches the hash in the previous output&#39;s pubkey script.</p>\n<p>For this reason, Bitcoin Core (and Dash Core) uses several different identifier bytes to help programs identify how keys should be used:</p>\n<ul>\n<li ><p>Private keys meant to be used with compressed public keys have 0x01 appended to them before being Base-58 encoded. (See the private key encoding section above.)</p>\n</li><li ><p>Uncompressed public keys start with 0x04; compressed public keys begin with 0x03 or 0x02 depending on whether they&#39;re greater or less than the midpoint of the curve.  These prefix bytes are all used in official secp256k1 documentation.</p>\n</li></ul>\n<h1 class=\"header-scroll\"><div class=\"anchor waypoint\" id=\"section-hierarchical-deterministic-key-creation\"></div>Hierarchical Deterministic Key Creation<a class=\"fa fa-anchor\" href=\"#section-hierarchical-deterministic-key-creation\"></a></h1>\n<p>The hierarchical deterministic key creation and transfer protocol (&lt;&lt;glossary:HD protocol&gt;&gt;) greatly simplifies wallet backups, eliminates the need for repeated communication between multiple programs using the same wallet, permits creation of child accounts which can operate independently, gives each parent account the ability to monitor or control its children even if the child account is compromised, and divides each account into full-access and restricted-access parts so untrusted users or programs can be allowed to receive or monitor payments without being able to spend them.</p>\n<p>The HD protocol takes advantage of the ECDSA public key creation function, <code>&lt;&lt;glossary:point&gt;&gt;()</code>, which takes a large integer (the private key) and turns it into a graph point (the public key):</p>\n<pre><code>point(private_key) == public_key\n</code></pre><p>Because of the way <code>point()</code> works, it&#39;s possible to create a &lt;&lt;glossary:child public key&gt;&gt; by combining an existing &lt;&lt;glossary:parent public key&gt;&gt; with another public key created from any integer (<em>i</em>) value. This child public key is the same public key which would be created by the <code>point()</code> function if you added the <em>i</em> value to the original (parent) private key and then found the remainder of that sum divided by a global constant used by all Dash software (<em>p</em>):</p>\n<pre><code>point( (parent_private_key + i) % p ) == parent_public_key + point(i)\n</code></pre><p>This means that two or more independent programs which agree on a sequence of integers can create a series of unique &lt;&lt;glossary:child key&gt;&gt; pairs from a single &lt;&lt;glossary:parent key&gt;&gt; pair without any further communication. Moreover, the program which distributes new public keys for receiving payment can do so without any access to the private keys, allowing the public key distribution program to run on a possibly-insecure platform such as a public web server.</p>\n<p>Child public keys can also create their own child public keys (grandchild public keys) by repeating the child key derivation operations:</p>\n<pre><code>point( (child_private_key + i) % p ) == child_public_key + point(i)\n</code></pre><p>Whether creating child public keys or further-descended public keys, a predictable sequence of integer values would be no better than using a single public key for all transactions, as anyone who knew one child public key could find all of the other child public keys created from the same parent public key. Instead, a random seed can be used to deterministically generate the sequence of integer values so that the relationship between the child public keys is invisible to anyone without that seed.</p>\n<p>The HD protocol uses a single &lt;&lt;glossary:root seed&gt;&gt; to create a hierarchy of child, grandchild, and other descended keys with unlinkable deterministically-generated integer values. Each child key also gets a deterministically-generated seed from its parent, called a &lt;&lt;glossary:chain code&gt;&gt;, so the compromising of one chain code doesn&#39;t necessarily compromise the integer sequence for the whole hierarchy, allowing the &lt;&lt;glossary:master chain code&gt;&gt; to continue being useful even if, for example, a web-based public key distribution program gets hacked.</p>\n<p><img src=\"https://dash-docs.github.io/img/dev/en-hd-overview.svg\" alt=\"Overview Of Hierarchical Deterministic Key Derivation\"></p>\n<p>As illustrated above, HD key derivation takes four inputs:</p>\n<ul>\n<li ><p>The <em>&lt;&lt;glossary:parent private key&gt;&gt;</em> and <em>&lt;&lt;glossary:parent public key&gt;&gt;</em> are regular uncompressed 256-bit ECDSA keys.</p>\n</li><li ><p>The &lt;&lt;glossary:parent chain code&gt;&gt; is 256 bits of seemingly-random data.</p>\n</li><li ><p>The &lt;&lt;glossary:index&gt;&gt; number is a 32-bit integer specified by the program.</p>\n</li></ul>\n<p>In the normal form shown in the above illustration, the &lt;&lt;glossary:parent chain code&gt;&gt;, the parent public key, and the index number are fed into a one-way cryptographic hash (<a href=\"https://en.wikipedia.org/wiki/HMAC\">HMAC-SHA512</a>) to produce 512 bits of deterministically-generated-but-seemingly-random data. The seemingly-random 256 bits on the right-hand side of the hash output are used as a new child chain code. The seemingly-random 256 bits on the left-hand side of the hash output are used as the integer value to be combined with either the parent private key or parent public key to, respectively, create either a child private key or child public key:</p>\n<pre><code>child_private_key == (parent_private_key + lefthand_hash_output) % G \nchild_public_key == point( (parent_private_key + lefthand_hash_output) % G ) \nchild_public_key == point(child_private_key) == parent_public_key + point(lefthand_hash_output)\n</code></pre><p>Specifying different index numbers will create different unlinkable child keys from the same parent keys.  Repeating the procedure for the child keys using the child chain code will create unlinkable grandchild keys.</p>\n<p>Because creating child keys requires both a key and a chain code, the key and chain code together are called the &lt;&lt;glossary:extended key&gt;&gt;. An &lt;&lt;glossary:extended private key&gt;&gt; and its corresponding &lt;&lt;glossary:extended public key&gt;&gt; have the same chain code. The (top-level parent) &lt;&lt;glossary:master private key&gt;&gt; and master chain code are derived from random data, as illustrated below.</p>\n<p><img src=\"https://dash-docs.github.io/img/dev/en-hd-root-keys.svg\" alt=\"Creating A Root Extended Key Pair\"></p>\n<p>A &lt;&lt;glossary:root seed&gt;&gt; is created from either 128 bits, 256 bits, or 512 bits of random data. This root seed of as little as 128 bits is the the only data the user needs to backup in order to derive every key created by a particular wallet program using particular settings.</p>\n\n</div>\n<div class=\"magic-block-callout type-warning \">\n\t<h3><i title=\"Warning\" class=\"fa fa-exclamation-circle\"></i>HD Wallet Compatibility\n\t</h3>\n\t<div class=\"callout-body\"><p><strong>Warning:</strong> HD wallet programs are not always fully compatible, so users must only use the same HD wallet program with the same HD-related settings for a particular root seed.</p>\n\n\t</div>\n</div>\n<div class=\"magic-block-textarea\"><p>The root seed is hashed to create 512 bits of seemingly-random data, from which the master private key and master chain code are created (together, the master extended private key). The master public key is derived from the master private key using <code>point()</code>, which, together with the master chain code, is the master extended public key. The master extended keys are functionally equivalent to other extended keys; it is only their location at the top of the hierarchy which makes them special.</p>\n<h2 class=\"header-scroll\"><div class=\"anchor waypoint\" id=\"section-hardened-keys\"></div>Hardened Keys<a class=\"fa fa-anchor\" href=\"#section-hardened-keys\"></a></h2>\n<p>Hardened extended keys fix a potential problem with normal extended keys. If an attacker gets a normal parent chain code and parent public key, he can brute-force all chain codes deriving from it. If the attacker also obtains a child, grandchild, or further-descended private key, he can use the chain code to generate all of the extended private keys descending from that private key, as shown in the grandchild and great-grandchild generations of the illustration below.</p>\n<p><img src=\"https://dash-docs.github.io/img/dev/en-hd-cross-generational-key-compromise.svg\" alt=\"Cross-Generational Key Compromise\"></p>\n<p>Perhaps worse, the attacker can reverse the normal &lt;&lt;glossary:child private key&gt;&gt; derivation formula and subtract a &lt;&lt;glossary:parent chain code&gt;&gt; from a child private key to recover the &lt;&lt;glossary:parent private key&gt;&gt;, as shown in the child and parent generations of the illustration above.  This means an attacker who acquires an &lt;&lt;glossary:extended public key&gt;&gt; and any private key descended from it can recover that public key&#39;s private key and all keys descended from it.</p>\n<p>For this reason, the &lt;&lt;glossary:chain code&gt;&gt; part of an extended public key should be better secured than standard public keys and users should be advised against exporting even non-extended private keys to possibly-untrustworthy environments.</p>\n<p>This can be fixed, with some tradeoffs, by replacing the the normal key derivation formula with a hardened key derivation formula.</p>\n<p>The normal key derivation formula, described in the section above, combines together the index number, the parent chain code, and the parent public key to create the child chain code and the integer value which is combined with the parent private key to create the child private key.</p>\n<p><img src=\"https://dash-docs.github.io/img/dev/en-hd-private-parent-to-private-child.svg\" alt=\"Creating Child Public Keys From An Extended Private Key\"></p>\n<p>The hardened formula, illustrated above, combines together the index number, the parent chain code, and the parent private key to create the data used to generate the child chain code and child private key. This formula makes it impossible to create child public keys without knowing the parent private key. In other words, parent extended public keys can&#39;t create hardened child public keys.</p>\n<p>Because of that, a &lt;&lt;glossary:hardened extended private key&gt;&gt; is much less useful than a normal extended private key---however, hardened extended private keys create a firewall through which multi-level key derivation compromises cannot happen. Because hardened child extended public keys cannot generate grandchild chain codes on their own, the compromise of a parent extended public key cannot be combined with the compromise of a grandchild private key to create great-grandchild extended private keys.</p>\n<p>The HD protocol uses different index numbers to indicate whether a normal or hardened key should be generated. Index numbers from <code>0x00</code> to <code>0x7fffffff</code> (0 to 2<sup>31</sup>-1) will generate a normal key; index numbers from <code>0x80000000</code> to <code>0xffffffff</code> will generate a hardened key. To make descriptions easy, many developers use the <a href=\"https://en.wikipedia.org/wiki/Prime_%28symbol%29\">prime symbol</a> to indicate hardened keys, so the first normal key (0x00) is 0 and the first hardened key (0x80000000) is 0´.</p>\n\n</div>\n<div class=\"magic-block-callout type-info no-title\"><span class=\"noTitleIcon\"><i title=\"Info\" class=\"fa fa-info-circle\"></i></span>\n\t<div class=\"callout-body\"><p>Dash developers typically use the ASCII apostrophe rather than the unicode prime symbol, a convention we will henceforth follow.</p>\n\n\t</div>\n</div>\n<div class=\"magic-block-textarea\"><p>This compact description is further combined with slashes prefixed by <em>m</em> or <em>M</em> to indicate hierarchy and key type, with <em>m</em> being a private key and <em>M</em> being a public key. For example, m/0&#39;/0/122&#39; refers to the 123rd hardened private child (by index number) of the first normal child (by index) of the first hardened child (by index) of the master private key. The following hierarchy illustrates prime notation and hardened key firewalls.</p>\n<p><img src=\"https://dash-docs.github.io/img/dev/en-hd-tree.svg\" alt=\"Example HD Wallet Tree Using Prime Notation\"></p>\n<p>Wallets following the &lt;&lt;glossary:BIP32&gt;&gt; &lt;&lt;glossary:HD protocol&gt;&gt; only create hardened children of the master private key (<em>m</em>) to prevent a compromised child key from compromising the master key. As there are no normal children for the master keys, the master public key is not used in HD wallets. All other keys can have normal children, so the corresponding extended public keys may be used instead.</p>\n<p>The HD protocol also describes a serialization format for extended public keys and extended private keys.  For details, please see the <a href=\"core-ref-wallets\">wallet section in the developer reference</a> or <a href=\"https://github.com/bitcoin/bips/blob/master/bip-0032.mediawiki\">BIP32</a> for the full HD protocol specification.</p>\n<h2 class=\"header-scroll\"><div class=\"anchor waypoint\" id=\"section-storing-root-seeds\"></div>Storing Root Seeds<a class=\"fa fa-anchor\" href=\"#section-storing-root-seeds\"></a></h2>\n<p>Root seeds in the HD protocol are 128, 256, or 512 bits of random data which must be backed up precisely. To make it more convenient to use non-digital backup methods, such as memorization or hand-copying, <a href=\"https://github.com/bitcoin/bips/blob/master/bip-0039.mediawiki\">BIP39</a> defines a method for creating a 512-bit root seed from a pseudo-sentence (mnemonic) of common natural-language words which was itself created from 128 to 256 bits of entropy and optionally protected by a password.</p>\n<p>The number of words generated correlates to the amount of entropy used:</p>\n<div class=\"marked-table\"><table>\n<thead>\n<tr>\n<th>Entropy Bits</th>\n<th>Words</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>128</td>\n<td>12</td>\n</tr>\n<tr>\n<td>160</td>\n<td>15</td>\n</tr>\n<tr>\n<td>192</td>\n<td>18</td>\n</tr>\n<tr>\n<td>224</td>\n<td>21</td>\n</tr>\n<tr>\n<td>256</td>\n<td>24</td>\n</tr>\n</tbody>\n</table></div>\n<p>The passphrase can be of any length.  It is simply appended to the mnemonic pseudo-sentence, and then both the mnemonic and password are hashed 2,048 times using HMAC-SHA512, resulting in a seemingly-random 512-bit seed.  Because any input to the hash function creates a seemingly-random 512-bit seed, there is no fundamental way to prove the user entered the correct password, possibly allowing the user to protect a seed even when under duress.</p>\n<p>For implementation details, please see <a href=\"https://github.com/bitcoin/bips/blob/master/bip-0039.mediawiki\">BIP39</a>.</p>\n<h1 class=\"header-scroll\"><div class=\"anchor waypoint\" id=\"section-loose-key-wallets\"></div>Loose-Key Wallets<a class=\"fa fa-anchor\" href=\"#section-loose-key-wallets\"></a></h1>\n<p>Loose-Key wallets, also called &quot;Just a Bunch Of Keys (JBOK)&quot;, are a form of wallet that originated from the Bitcoin Core client wallet. The Dash Core client wallet creates 1000 private key/public key pairs automatically via a Pseudo-Random-Number Generator (PRNG) for later use.</p>\n<p>These unused private keys are stored in a virtual &quot;key pool&quot;, with new keys being generated whenever a previously-generated key was used, ensuring the pool maintained 1000 unused keys. (If the wallet is encrypted, new keys are only generated while the wallet is unlocked.)</p>\n<p>This creates considerable difficulty in backing up one’s keys, considering backups have to be run manually to save the newly-generated private keys. If a new key pair set is generated, used, and then lost prior to a backup, the stored duffs are likely lost forever. Many older-style mobile wallets followed a similar format, but only generated a new private key upon user demand.</p>\n<p>This wallet type is being actively phased out and discouraged from being used due to the backup hassle.</p>\n\n</div>"
}